CREATE DATABASE main_service;
CREATE DATABASE user_service;
CREATE DATABASE chat_service;

INSERT INTO member_specializations (name) VALUES
('Backend-разработчик'),
('Frontend-разработчик'),
('Fullstack-разработчик'),
('DevOps-инженер'),
('QA-инженер'),
('Мобильный разработчик'),
('Инженер по данным'),
('Системный архитектор'),
('Инженер по информационной безопасности');

INSERT INTO article_categories (name) VALUES
('Наука'),
('Технологии'),
('Программирование'),
('Искусственный интеллект'),
('Кибербезопасность'),
('Инженерия'),
('Космос'),
('Медицина и биотехнологии'),
('Экология'),
('Образование');

INSERT INTO news_categories (name) VALUES
('Наука'),
('Технологии'),
('Программирование'),
('Искусственный интеллект'),
('Кибербезопасность'),
('Инженерия'),
('Космос'),
('Медицина и биотехнологии'),
('Экология'),
('Образование');

INSERT INTO project_categories (name) VALUES
('Наука'),
('Технологии'),
('Программирование'),
('Искусственный интеллект'),
('Кибербезопасность'),
('Инженерия'),
('Космос'),
('Медицина и биотехнологии'),
('Экология'),
('Образование');